[
  {
    "id": "1",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/probe-agency-grills-jharkhand-mla-pradeep-yadav-in-money-laundering-case-4083780",
    "title": "Probe Agency Grills Jharkhand MLA Pradeep Yadav In Money Laundering Case",

    "text": "Pradeep Yadav alleged that BJP was using central agencies to target the opposition leaders (File)Ranchi:The Enforcement Directorate (ED) on Wednesday interrogated Congress MLA Pradeep Yadav as part of its investigation into a money laundering case, officials said.The agency on Tuesday had conducted searches at a dozen locations in Jharkhand linked to Pradeep Yadav, a five-time legislator from the Poraiyahat seat and deputy leader of the Congress in the assembly, they said.After the questioning, the MLA said he will soon approach the court over the ED action. He claimed the ED found nothing objectionable in its raids so far.Pradeep Yadav alleged that the BJP was using central agencies to target the opposition leaders.Fifty-seven-year-old Pradeep Yadav and another MLA's premises were raided by the Income Tax Department last year as part of a tax evasion probe against some business groups engaged in coal trading and transportation, extraction of iron ore and production of sponge iron in Jharkhand.PromotedListen to thelatest songs, only onJioSaavn.comThe money laundering investigation stems from this tax case, officials added.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF FINANCE"
  },
  {
    "id": "2",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/20-year-old-arrested-days-after-girl-found-dead-in-kerala-madrassa-cops-4083818",
    "title": "20-Year-Old Arrested Days After Girl Found Dead In Kerala Madrassa: Cops",

    "text": "The victim's family alleged that she was mentally harassed by the Madrassa teacher. (Representational)Thiruvananthapuram:Police have arrested a 20-year-old man in connection with a murder of a 17-year-old girl who was allegedly found hanging inside a Madrassa library in Kerala's Balarampuram city earlier this month.According to the police, the victim, Asmiya Mole, was in an \"intimate relationship\" with the accused.\"The accused has been arrested under the Prevention of Children from Sexual Offences Act (POCSO),\" police said.Police had filed a case on a complaint of the victim's mother alleging mental harassment by a teacher at the institutionThe deceased, was a student at a religious study centre near Balarampuram, and was staying in the hostel.According to Balarampuram police, Asmiya Mole had called her mother earlier in the month and asked to take her back home.\"Her mother reached the Madrassa around 4.30 pm. She was asked to get permission. Around 6.30 pm she was informed that the girl was found hanging inside the library. Her mother took her to a private hospital in Neyyattinkara. She was declared brought dead on arrival at 7 pm,\" police said earlier in the month.The girl's uncle Tajudeen earlier told ANI that she came home during Ramzan and told her mother that a new teacher in the Madrassa was harassing her mentally.PromotedListen to thelatest songs, only onJioSaavn.com\"She returned to Madrassa on May 2 and complained to her mother again about the teacher. After reporting the matter to the Madrassa administration, the Ustad (teacher) asked her mother why Asmiya did not complain to him instead,\" he said earlier in the month.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF WOMEN AND CHILD DEVELOPMENT"
  },
  {
    "id": "3",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/india-china-agree-to-hold-next-round-of-military-talks-soon-over-ladakh-4083831",
    "title": "India, China Agree To Hold Next Round Of Military Talks Soon Over Ladakh",

    "text": "The two sides reviewed the situation along the LAC in Western Sector of border areas on Wednesday.New Delhi:India and China on Wednesday held in-person diplomatic talks here and discussed proposals for disengagement in the remaining friction points along the Line of Actual Control (LAC) in eastern Ladakh in a \"frank and open manner\".The Ministry of External Affairs (MEA) said restoration of peace and tranquillity will create conditions for normalising bilateral relations and to this objective both sides agreed to hold the next round of military talks at an early date.The meeting took place under the framework of Working Mechanism for Consultation and Coordination on India-China Border Affairs (WMCC).\"The two sides reviewed the situation along the LAC in Western Sector of India-China border areas and discussed proposals for disengagement in remaining areas in a frank and open manner,\" the MEA said.\"Restoration of peace and tranquillity will create conditions for normalising bilateral relations,\" it said.\"In order to achieve this objective, in accordance with existing bilateral agreements and protocols, they agreed to hold the next (19th) round of Senior Commander's meeting at an early date,\" the MEA said in a statement.PromotedListen to thelatest songs, only onJioSaavn.comIt said the two sides agreed to continue discussions through military and diplomatic channels.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF HOME AFFAIRS"
  },
  {
    "id": "4",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/17-year-old-boy-arrested-for-marrying-minor-girl-in-delhi-cops-4083839",
    "title": "17-Year-Old Boy Arrested For Marrying Minor Girl In Delhi: Cops",

    "text": "They performed 'nikah' in West Bengal on August 25, 2022, a senior police officer said.(Representational)New Delhi:A 17-year-old boy was apprehended for allegedly marrying a minor girl and impregnating her in east Delhi's Laxmi Nagar area, police said on Wednesday.According to police, a PCR call was received on Monday from Lal Bahadur Shastri (LBS) hospital that a seven-month minor pregnant girl has come to the facility for check up.Police reached the hospital where the minor girl, a resident of West Bengal, told them that she and her cousin loved each other. They performed 'nikah' in West Bengal on August 25, 2022, a senior police officer said.In January, they came to Delhi and started living in a rented accommodation at West Jawahar Park, police said.She came to LBS hospital for routine check up on Monday and being a minor, the doctor attending her called Sakhi centre and also informed the police, they said.Subsequently, a case under the Indian Penal Code and the Protection of Children from Sexual Offences (POCSO) Act was registered, police said.After her counselling and medical examination, the girl was kept under hospital observation while the boy was apprehended and produced before the Juvenile Justice Board (JJB) on Tuesday, they said.PromotedListen to thelatest songs, only onJioSaavn.comThe JJB released the juvenile on an undertaking and fixed the next date of hearing for age verification. Further investigation is in progress, they added.(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF WOMEN AND CHILD DEVELOPMENT"
  },
  {
    "id": "5",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/will-not-compromise-on-sachin-pilot-amid-tussle-with-ashok-gehlot-4083848",
    "title": "\"Will Not Compromise On...\": Sachin Pilot Amid Tussle With Ashok Gehlot",

    "text": "Earlier, Congress said Sachin Pilot and Ashok Gehlot both had agreed to work unitedly.Jaipur:Days after the Congress leadership projected that the tussle in its Rajasthan unit was on hold, Sachin Pilot on Wednesday made it clear that he will not budge on his demands from the Ashok Gehlot government.On a visit to his Tonk assembly constituency, the dissident Congress leader indicated that it was the last day before what was being seen as an ultimatum to Mr Gehlot ends.\"So, let us see what happens tomorrow,\" he told reporters.The feud between the chief minister and his former deputy escalated a few weeks back with Mr Pilot holding a daylong fast demanding action by the state government against \"corruption\" during the previous BJP term in the state.And while ending a five-day foot march later, he said this and his two other demands should be met by this month-end or he will launch a state-wide agitation.Congress chief Mallikarjun Kharge and former party president Rahul Gandhi met the two Rajasthan leaders on Monday. The party said they both had agreed to work unitedly.But in Tonk, Mr Pilot signalled that he is sticking to his stand.\"I want to say it again that the issues that I had raised, particularly the corruption issue... vast corruption and loot in the previous BJP rule... action will have to be taken on them.\"As far as getting justice for the youth is concerned, I think there is no possibility of any compromise on it,\" Mr Pilot said, referring to exams for government jobs being cancelled after paper leaks.\"I had said on May 15 that the state government should take action on the issues of corruption by the BJP government and the youth,\" he said, reminding that this was the \"last day of the month\".Pilot said he is waiting for action by the Gehlot government.\"Talks were held in Delhi the day before yesterday. They (the leadership) said the responsibility of taking action lies with the state government. So, let us see what happens tomorrow,\" he said.The Congress on Monday had sought to project that all was fine now with its Rajasthan unit, where the two leaders have tussled over leadership since the party's government came to power.There were suggestions that the party had worked out a formula for both the state leaders to work together and fight the year-end assembly elections unitedly.Mr Pilot said the filling of vacant posts at the Rajasthan Public Service Commission (RPSC) was necessary for its better functioning.He said the youths who live in rented accommodation while preparing for competitive examinations suffer when papers get leaked. So the aspirants should get financial compensation in such situations, he added.Referring to the Congress win in the Karnataka Assembly elections, he said the BJP lost as it repeatedly \"deceived\" people.\"They talk about double engines. But now those engines have started seizing,\" Pilot said. The BJP uses the \"double engine\" analogy to claim that there is development when the party is in power both in the state and at the Centre.Pilot said the BJP regime in Karnataka was corrupt and the Congress had accused it of being a \"40 percent commission\" government. The people agreed with this and voted for the Congress, he claimed.PromotedListen to thelatest songs, only onJioSaavn.comWhile ending his five-day 'Jan Sangharsh Yatra' in Jaipur, Pilot had made three demands -- reconstitution of the Rajasthan Public Service Commission (RPSC), compensation to youths affected by the leak of exam papers, and a high-level probe into allegations of corruption against the previous Vasundhara Raje government.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF PERSONNEL, PUBLIC GRIEVANCES & PENSIONS"
  },
  {
    "id": "6",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/probe-agency-ed-attaches-assets-worth-rs-124-crore-of-chennai-based-surana-group-4083906",
    "title": "Probe Agency ED Attaches Assets Worth Rs 124 Crore Of Chennai-Based Firm",

    "text": "The agency initiated a money laundering investigation on the basis of three FIRs against Surana Groups.Chennai:The Enforcement Directorate (ED) on Tuesday said it has attached 78 immovable and 16 movable properties worth Rs 124 crores in the possession of various persons and entities linked to the Chennai-based Surana Group of Companies under the Prevention of Money Laundering Act (PMLA).The action is in connection with the three cases of bank fraud involving Rs 3,986 crore of principal outstanding amount to the public sector banks, said the ED.Earlier, on August 2022, ED had attached 75 immovable properties, including 67 windmills valued at Rs 113.32 crore in total, of Chennai-based Surana Group of Companies, under the provisions of the Money Laundering Act.The agency initiated a money laundering investigation on the basis of three FIRs by the Central Bureau of Investigation, BF and SB, Bengaluru registered against M/s Surana Industries Limited and others, M/s Surana Power Limited and Others, and M/s Surana Corporation Limited and others.Based on the investigations conducted, 67 windmills with land valued at Rs 51.69 crore and various immovable properties valued at Rs 61.63 crore of Shri Ramlal Jain, who allegedly put the proceeds of crime into his regular business, were provisionally attached under the provisions of PMLA. The combined value of the windmills and immovable properties was estimated at Rs 113.32 crore.ED stated that its investigations revealed that these three companies of Surana Group defrauded the banks by floating a web of shell companies wherein they appointed its employees/ relatives as Directors/ Proprietors/ Partners and indulged in paper transactions with them without actual movement of goods, the credit capital of the banks was round-tripped/ layered to the personal accounts of the promoters of the company by projecting the bank funds as unsecured loans from their associate shell companies and same funds were subsequently infused in the leading group companies as part of the promoters' contribution to enhance the DP limits.The probe revealed further that the Surana Group has companies in the Cayman Islands and the British Virgin Islands in the name of dummy directors and siphoned off money to be parked in these firms.For this purpose, ED said they established four companies in Singapore and exported goods to them and the money received from them was written off in the book of accounts in India. Further, a portion of the diverted funds was used to purchase movable/immovable properties in the names of various benami persons/ companies, the agency informed further.These actions of the promoters/officials of the Surana Group led to the accounts becoming irregular, ultimately resulting in the accounts turning into NPAs, ED said.Based on the investigations conducted, Shri Dinesh Chand Surana, MD of M/s Surana Industries Limited and M/s Surana Power Ltd, Shri Vijay Raj Surana, MD of M/s Surana Corporation Limited, and two dummy directors of shell companies -- P Anand and I Prabhakaran -- were arrested on July 12. The principal session judge in Chennai remanded them to judicial custody.PromotedListen to thelatest songs, only onJioSaavn.comFurther Investigation is underway in the matter.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF CORPORATE AFFAIRS"
  },
  {
    "id": "7",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/hemant-soren-confirms-his-partys-participation-in-patna-opposition-meet-4083927",
    "title": "Hemant Soren Confirms His Party's Participation In Patna Opposition Meet",

    "text": "Jharkhand CM Hemant Soren said that his party will join meeting of opposition force in Patna.Ranchi:Jharkhand Chief Minister and Jharkhand Mukti Morcha (JMM) leader Hemant Soren on Wednesday confirmed his party's attendance at the meeting of leading Opposition forces in Patna on June 12.To a question on whether his party would attend the meeting of Opposition forces in Patna, CM Soren said, \"Since all Opposition parties have enlisted their participation at the meeting, we, too, would attend it.\"Earlier, on Sunday, Janata Dal (United) leader Manjit Singh said Bihar Chief Minister Nitish Kumar will chair a meeting of leading Opposition players in the state capital on June 12.The Bihar CM has been spearheading efforts to bring all Opposition parties together against the BJP government at the Centre, with an eye on next year's Lok Sabha polls.As part of the effort to galvanise the Opposition against Prime Minister Narendra Modi and the BJP, he has already met the likes of Congress leader Rahul Gandhi, West Bengal Chief Minister Mamata Banerjee and Nationalist Congress Party (NCP) chief Sharad Pawar.Speaking to ANI earlier, the JDU leader said, \"On June 12, there will be a grand meeting of Opposition parties in Bihar under the leadership of Nitish Kumar, which will send a message to the whole country. Bihar will lay the groundwork for the change in the country.\"\"You will see all like-minded parties standing together,\" he added.Bhartiya Janata Party (BJP)'s Bihar unit president Samrat Choudhary confirmed earlier that Prime Minister Modi will visit Bihar in June and is likely to address a public meeting, ahead of the opposition meeting in Patna.\"BJP is doing 'Jan Sampark Abhiyan' from May 30 to June 30 across Bihar in a bid to reach out to people and for that, we have invited PM Narendra Modi to visit the state. We got a positive response from the PM and are looking forward to his visit,\" Samrat Choudhary told media persons earlier.PromotedListen to thelatest songs, only onJioSaavn.com(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Positive",
    "government_body": "PRIME MINISTER'S OFFICE"
  },
  {
    "id": "8",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/gold-worth-over-rs-72-lakh-seized-at-tamil-nadu-trichy-airport-3-arrested-4083938",
    "title": "Gold Worth Over Rs 72 Lakh Seized At Tamil Nadu Airport, 3 Arrested",

    "text": "Gold was seized from 3 passengers who arrived from Kuala Lumpur on Wednesday. (Representational)Tiruchirappalli:The Air Intelligence Unit (AIU) at Trichy International Airport arrested three passengers on Wednesday and seized 1197.5 grams of 24-carat gold worth Rs 72,73,781, officials said on Wednesday.The official informed the gold was seized from three passengers who arrived from Kuala Lumpur on Wednesday.\"The Air Intelligence Unit (AIU) of Trichy seized 1197.5 grams of 24-carat gold worth Rs 72,73,781 from two male and one female passengers. While two passengers arrived from Kuala Lumpur, another arrived from Dubai via Colombo,\" said an official.They added that the gold was brought by the passengers through concealments (rectum and in person) in metal and in paste forms.Further investigation into the matter is underway.Earlier, in May this year, the Air Intelligence Unit (AIU) at Trichy International Airport seized 1091 grams of 24-carat gold worth Rs 67,05,286 from a male passenger.An official said the gold was seized from a male passenger who arrived from Kuala Lumpur.\"The Air Intelligence Unit (AIU) of Trichy seized 1091 grams of 24-carat gold worth Rs 67,05,286 from a male passenger. The gold was concealed in dart arrows, SCSI connectors and pant ticket pocket,\" an AIU official said.Earlier, in February this year, the customs department at Trichy airport in Tamil Nadu seized gold worth Rs 47,67,198 and electronic goods worth Rs 4,25,000 from a male passenger who arrived from Dubai on an Indigo Flight.The items, including gold and electronic goods, were valued at about Rs 51,92,198, officials said.Earlier on January 29, officials of the customs department at Trichy international airport seized foreign currency of USD 10,000 concealed in the undergarments of a male passenger.PromotedListen to thelatest songs, only onJioSaavn.comIn December last year, the Customs Air Intelligence Unit (AIU) at Trichy airport intercepted a man and seized two gold biscuits, valued at over Rs 8 lakh, concealed inside a tin. The gold pieces weighed 147.5 grams and were of 24 carats.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF CIVIL AVIATION"
  },
  {
    "id": "9",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/woman-strangled-to-death-in-uttar-pradesh-cops-4083943",
    "title": "Woman Strangled To Death In Uttar Pradesh: Cops",

    "text": "A woman was allegedly strangled to death in Uttar Pradesh's Sitapur, police said. (Representational)Sitapur:A woman was allegedly strangled to death in the Sadarpur area of Sitapur in Uttar Pradesh, police said on Thursday.According to the Additional Superintendent of Police (ASP) Narendra Pratap Singh, the victim was identified as Janaki Dev.ASP Singh said on the information of the villagers, the police officers reached the spot and started an investigation.\"The incident took place in Saraiyan Patti village in the Sadarpur police station area. The victim had left her old home to light a lamp in her newly constructed home, which was built with funds allocated under the Pradhan Mantri Awas Yojana,\" said the ASP.He informed further that as time ticked by and the woman did not return home, her relatives started looking for her.After searching for a while, the woman was found dead by a road, at some distance from her home, informed ASP Singh.He added that the victim's body bore external injury marks, thereby indicating that her death may have been the fallout of a domestic issue.\"The victim had injury marks all over her body. We suspect that her death may have been the fallout of a domestic issue,\" he said.The ASP added that further action will follow once a case of murder is registered in the matter.PromotedListen to thelatest songs, only onJioSaavn.com\"We have taken custody of the victim's body and sent it for a post-mortem examination,\" the officer said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF WOMEN AND CHILD DEVELOPMENT"
  },
  {
    "id": "10",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/65-year-old-mother-daughter-found-dead-in-delhi-home-cops-suspect-murder-4083960",
    "title": "65-Year-Old Mother, Daughter Found Dead In Delhi Home, Cops Suspect Murder",

    "text": "The victims were identified as Rajrani and her daughter Ginni Karar, police said. (Representational)New Delhi:A mother and daughter were found dead inside their apartment in the Krishna Nagar area of the national capital, police said on Wednesday.Police said they recieved a PCR call at 8 pm about a foul smell emanating from the flat and a team was rushed to the spot.Rohit Meena, DCP Shahdara, said, \"We were informed about a foul smell coming from a first-floor apartment at Krishna Nagar E block at 8 pm. A police team rushed to the spot and recovered the bodies of a 65-year-old woman and her 36-year-old daughter from inside the flat. Prima facie, it appears that a third person known to the deceased might have been inside the apartment. We are probing all angles.\"The deceased were identified as Rajrani and her daughter Ginni Karar.The police informed that the house in which bodies were found had a twin locking system, one at the main entrance gate and another at the main door which could be opened only on authorisation.PromotedListen to thelatest songs, only onJioSaavn.com\"We have obtained vital clues and an investigation is underway. We are conducting raids through multiple teams and the matter is being investigated from all angles,\" the DCP added.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF HOME AFFAIRS"
  },
  {
    "id": "11",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/dmk-will-take-wholehearted-efforts-to-coordinate-opposition-mk-stalin-4083971",
    "title": "DMK Will Take Wholehearted Efforts To Coordinate Opposition: MK Stalin",

    "text": "MK Stalin said DMK will take all steps to coordinate the opposition ahead of the 2024 Lok Sabha polls.Chennai:Tamil Nadu Chief Minister M K Stalin on Wednesday said his DMK will take all steps to coordinate the opposition ahead of the 2024 Lok Sabha polls.Addressing reporters upon his arrival here from Japan, he also charged the ruling BJP at the Centre with trying to \"intimidate\" opposition parties using agencies like Income Tax, CBI and ED, while responding to the I-T searches at relatives and individuals linked to his cabinet colleague V Senthil Balaji last week.The Chief Minister returned here following a nine-day official trip of Singapore and Japan to attract more investments in the state.Asked about his meeting with AAP leaders -- CMs of Delhi and Punjab, Arvind Kejriwal and Bhagwant Mann respectively -- here on Thursday and if it was part of \"coordinating the opposition\", the DMK President said, \"That effort is already on.\" \"This is not new. DMK will also be involved in it wholeheartedly,\" he said.Asked about the 'Sengol' (sceptre) being installed in the new Parliament building and if it signified Tamil pride, the Chief Minister said that would have been the case if it was truly from the Chola dynasty as claimed.\"The Sengol was bent following the way in which our women wrestlers were assaulted\" that day by police, he said, referring to their protest demanding arrest of Wrestling Federation of India chief Brij Bhushan Sharan Singh for alleged sexual harassment.PromotedListen to thelatest songs, only onJioSaavn.comOn his two-nation trip, MK Stalin said investment proposals over Rs 3,000 crore have been signed.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF HOME AFFAIRS"
  },
  {
    "id": "12",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/i-presume-my-iphone-is-being-tapped-rahul-gandhi-in-us-4083989",
    "title": "\"Hello, Mr Modi\", Rahul Gandhi Quips, Holding His iPhone, Alleges Tapping",

    "text": "\"There is need to have appropriate regulations on data safety and security,\" Mr Gandhi said.Washington:Congress leader Rahul Gandhi Wednesday spent the first half of his day with Silicon Valley-based startup entrepreneurs, known for doing path-breaking work in the field of Artificial Intelligence and cutting-edge technologies.Sitting in the front row of the Plug and Play auditorium along with Indian Overseas Congress chairperson Sam Pitroda and some other key aides who have been travelling with him from India, Mr Gandhi was seen engrossed in the panel discussion of experts on various aspects of artificial intelligence, big data, machine learning and their implications on mankind in general and on issues like governance, social welfare measures and also disinformation and misinformation.Based out of Sunnyvale in California, the Plug and Play Tech Centre is one of the largest incubator of startups. According to its CEO and Founder Saeed Amidi, more than 50 per cent of the startups founder at Plug and Play have been Indians or Indian Americans. Mr Amidi toldPTIafter the event that Mr Gandhi has shown a deep understanding of the IT sector and his knowledge of latest and cutting edge technologies are quite impressive.Participating in a fireside chat with Mr Amidi and Shaun Shankaran, founder of FixNix Startup, Mr Gandhi tried to link all the technologies with the impact this would have on the common man in the remote villages of India.\"If you want to spread any technology in India, you have to have a system where power is relatively decentralized,\" he said in response to a question and then went on to share with the select group of invited entrepreneurs about his personal experience of drone technology and its regulation, which, according to him, \"faced massive bureaucratic hurdles\".Data, Mr Gandhi said, is the new gold and countries like India have realized the real potential of it. \"There is need to have appropriate regulations on data safety and security\".However, on the issue of Pegasus spyware and similar technologies, Mr Gandhi told the audience he is not worried about it. At one point of time he said he knows his phone is being tapped. And jokingly said, \"Hello! Mr Modi\" on his iPhone.\"I presume my iPhone is being tapped. You need establish rules with regard to privacy of data information as a nation and also as an individual,\" he said.\"If a nation state decides that they want to tap your phone, no one can stop you. This is my sense,\" he said. \"If the nation is interested in tapping phone, then this is not a battle worth fighting. I think whatever I do and work, is available to the government,\" he claimed.PromotedListen to thelatest songs, only onJioSaavn.comMr Shankaran, who hosted Mr Gandhi for the AI event at Plug and Play, said he is very much impressed about the knowledge he has shown about the latest developments in technology.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF COMMUNICATIONS"
  },
  {
    "id": "13",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/amit-shah-directs-officials-to-bring-back-normalcy-at-earliest-in-violence-hit-manipur-4083992",
    "title": "Amit Shah Meets Manipur Community Leaders In Bid To End Unrest: 10 Points",

    "text": "Amit Shah is on a four-day visit to Manipur till June 1.New Delhi:The situation in Manipur continues to remain tense with reports of firing and attacks being reported in parts of the state. Union Home Minister Amit Shah has directed officials to take \"stern and prompt actions\" to bring back normalcy at the earliestHere are the top 10 updates on this story:Dozens of houses were set on fire and gunfights raged between suspected militants and security personnel in several districts on Wednesday as Amit Shah visited relief camps sheltering displaced Kuki tribals and Meitei families in Imphal.Amit Shah, who is on a four-day visit to the state, also had wide-ranging discussions with civil society organisations and security forces in Moreh and Kangpokpi. Shortly after the meeting, Mr Shah, in a tweet said that the civil society groups have lent strong support for the government's initiatives to restore normalcy in the state.\"Our resolve remains focused on leading Manipur back to the track of peace and harmony once again and their return to their homes at the earliest,\" Mr Shah said in the meeting, officials said.Later, the Home Minister held a security review meeting with top officials and directed them to take stern and prompt actions to prevent violence and recover looted weapons to bring back normalcy at the earliest, his office said in a statement. Chief Minister Biren Singh has warned of legal action against anyone found to be in unauthorised and illegal possession of arms and ammunition.In a signed statement, the chief minister also appealed to the concerned not to block roads or hinder the free movement of security personnel and relief material. Such roadblocks were making it extremely difficult for security and police personnel to respond to attacks by armed groups on time, Mr Singh said. The Manipur government has extended the ban on internet services for five more days till June 5.The state witnessed a sudden spurt in clashes and firing between insurgents and security forces on Sunday, after a relative lull for over a fortnight.With the state government unable to control the situation even after a month, members from the Kuki-Hmar-Zomi-Mizo tribes on Wednesday held a protest demanding that the Chief Minister be sacked and President's rule implemented in the state.The ethnic violence first broke out after a 'Tribal Solidarity March' was organised in the hill districts on May 3 to protest the Meitei community's demand for Scheduled Tribe (ST) status.The violence was preceded by tension over the eviction of Kuki villagers from reserve forest land, which had led to a series of smaller agitations.Meiteis account for about 53 per cent of Manipur's population and live mostly in the Imphal Valley. Tribals -- Nagas and Kukis -- constitute another 40 percent of the population and reside in the hill districts. So far, over 80 people have been killed in the violence, according to officials.Post a comment",
    "tone": "Neutral",
    "government_body": "MINISTRY OF HOME AFFAIRS"
  },
  {
    "id": "14",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/wrestlers-protest-against-brij-bhushan-singh-continues-farmers-call-for-khap-mahapanchayat-today-10-facts-4084005",
    "title": "Mega Farmers' Meet Today To Discuss Wrestlers' #MeToo Protest: 10 Facts",

    "text": "New Delhi:Several wrestlers continue to protest against former Wrestling Federation of India chief Brij Bhushan despite calls from the government to trust the ongoing police probe. Farmers today will hold a 'mahapanchayat' to discuss the issue.Here are 10 facts about the big story:The Bharatiya Kisan Union (BKU) has said that a grand meeting of all khaps will be held in Uttar Pradesh's Muzaffarnagar today to discuss the wrestlers' protest, who have levelled sexual harassment charges against embattled WFI chiefBrij Bhushan Sharan Singh.BKU leader Naresh Tikait says that several representatives of different khaps and their heads from Uttar Pradesh, Haryana, Punjab Rajasthan, and Delhi will be participating in the mahapanchayat.Mr Tikait played a key role in persuading some of India's best wrestlers to not immerse their medals in Ganga on Tuesday.Olympic medallists Sakshi Malik, Bajrang Punia, and Asian Games gold medallist Vinesh Phogat went to Haridwar on Tuesday and threatened to immerse their medals in the river due to the lack of action against the WFI chief. They refrained from doing so after being convinced by the farmer leaders and given a five-day deadline to the police.The wrestlers have been on the warpath since January, demanding action against WFI chief Brij Bhushan Sharan Singh, whom they accused of sexually harassing seven athletes, including a minor.Brij Bhushan Sharan Singh, a BJP MP, has denied any wrongdoing and asserted that he would hang himself if the allegations against him were proven.\"If a single allegation against me is proven, I will hang myself. If you (wrestlers) have any evidence, present it to the Court, and I am ready to accept any punishment,\" he said.Union sports minister Anurag Thakur yesterday accused the protesting wrestlers of \"changing goalposts\" and in the government's first comment on the issue in recent days, reiterated that they should not take any step that \"hurts the sport or other athletes\".\"The athletes themselves had said that the platform is not for doing politics. But later political parties came and went and shared this platform,\" the minister told reporters, referring to visits by opposition leaders to the wrestlers' protest site at Delhi's Jantar Mantar.Internationally, the United World Wrestling (UWW), the sport's governing body, issued a statementcriticising the \"lack of results\" in the investigationsagainst Mr Singh. The UWW reminded the Indian Olympic Association (IOA) of its promise to hold fresh elections for the WFI within 45 days and warned that failure to do so may lead to the suspension of the federation.Post a comment",
    "tone": "Positive",
    "government_body": "MINISTRY OF YOUTH AFFAIRS AND SPORTS"
  },
  {
    "id": "15",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/pak-intruder-shot-dead-by-bsf-along-ib-in-j-ks-samba-4084045",
    "title": "Pak Intruder Shot Dead By Border Security Force In Jammu And Kashmir's Samba",

    "text": "The incident took place near Mangu Chak border outpost in Samba sector. (Representational image)Samba/Jammu:A suspected Pakistani intruder was shot dead by BSF troops along the International Border (IB) in Jammu and Kashmir's Samba district in the early hours of Thursday, officials said.The incident took place near Mangu Chak border outpost (BoP) in Samba sector around 2:50 am, they said.\"In the early hours today, alert BSF troops noticed suspicious movement of a person, who crossed the IB from Pakistan's side, in Samba area,\" a Border Security Force spokesperson said.He was challenged by the troops but the intruder kept advancing towards the border fencing. The troops opened fire, killing him, the spokesperson said.The BSF has launched a search operation along the IB in Samba sector as the intruder's body is lying in the forward area.This is the second such incident along the India-Pakistan border in Jammu division in two days.PromotedListen to thelatest songs, only onJioSaavn.comOn Wednesday, the Army foiled an infiltration bid with the arrest of three terrorists along the Line of Control (LoC) in Poonch district.The terrorists, from whom a huge consignment of arms and narcotics was recovered, were arrested after an exchange of fire near the border fence, according to a defence spokesperson.",
    "tone": "Neutral",
    "government_body": "MINISTRY OF HOME AFFAIRS"
  },
  {
    "id": "16",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/india-cannot-be-pushed-around-rahul-gandhi-on-india-china-relations-4084065",
    "title": "\"India Cannot Be Pushed Around\": Rahul Gandhi On India-China Relations",

    "text": "At the end of the day, India has to look for its own interest, Mr Gandhi said.Stanford (California):Congress leader Rahul Gandhi has asserted that India cannot be pushed around by China as he underlined that the relationship between the two neighbours is going to be \"tough\" and not an easy one.Mr Gandhi, who is in the US for a three-city US tour, made the remarks on Wednesday night in response to a question from Indian students at the Stanford University Campus in California.\"How do you see the India-China relationship evolving in the next 5-10 years? he was asked.Mr Gandhi replied, \"It's tough right now. I mean, they've occupied some of our territory. It's rough. It's not too easy (a relationship).\" \"India cannot be pushed around. That something is not going to happen, Mr Gandhi said.India and China are also locked in a lingering border standoff in eastern Ladakh for three years.The bilateral relationship came under severe strain following the deadly clash in Galwan Valley in eastern Ladakh in June 2020.India has maintained that the bilateral relationship cannot be normal unless there is peace in the border area.During his interaction at Stanford University, Mr Gandhi supported New Delhi's policy of having its relationship with Russia in the context of the Ukrainian war, despite the pressure it feels from the West.\"We have a relationship with Russia, we have certain dependencies on Russia. So, I would have a similar stance as the Government of India, Mr Gandhi said in response to a question when asked does he supports India's neutral stance on Russia.At the end of the day, India has to look for its own interest. India, he said, is a big enough country whereby it generally will have relationships with other countries.It's not so small and dependent that it will have a relationship with one and nobody else, he added.\"We will always have these types of relationships. We will have better relationships with some people, evolving relationships with other people. So that balance is there, the former Congress president said.PromotedListen to thelatest songs, only onJioSaavn.comSupporting a strong relationship between India and the United States, Mr Gandhi underscored the importance of manufacturing and both countries collaborating in emerging fields like data and artificial intelligence. Simply focusing on the security and defence aspect of this bilateral relationship is not enough he said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF EXTERNAL AFFAIRS"
  },
  {
    "id": "17",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/rahul-gandhi-on-his-disqualification-from-lok-sabha-didnt-imagine-4084105",
    "title": "Disqualification As MP Gave Me \"Huge Opportunity\": Rahul Gandhi In US",

    "text": "Rahul Gandhi emphasised in his frequent foreign trips like this, he is not seeking support from anybody.Stanford (California):Congress leader Rahul Gandhi has said that he did not imagine his disqualification from Lok Sabha was possible when he joined politics but asserted that it has given him a \"huge opportunity\" to serve the people.Mr Gandhi, who is in the US for a three-city US tour, made the remarks on Wednesday night in response to a series of questions from Indian students at the prestigious Stanford University Campus in California.The Wayanad (Kerala) Member of Parliament was disqualified from Lok Sabha earlier this year after he was convicted by a Surat court in a 2019 criminal defamation case over his \"Modi surname\" remark.In his remarks, Mr Gandhi said that when he joined politics in 2000, he never imagined this is what he would go through. What he sees is going on now is way outside anything that he had thought when he joined politics.Referring to his disqualification from Lok Sabha as a Member of Parliament, Mr Gandhi, 52, said he didn't imagine that something like this was possible.\"But then I think it's actually given me a huge opportunity. Probably much bigger than the opportunity I would have. That's just the way politics works, he said.\"I think the drama started really, about six months ago. We were struggling. The entire opposition is struggling in India. Huge financial dominance. Institutional capture. We're struggling to fight the democratic fight in our country, he said, adding that at this point in time, he decided to go for the Bharat Jodo Yatra'.\"I am very clear, our fight is ours fight, he said. But there is a group of young students from India here. I want to have a relationship with them and want to talk to them. It's my right to do it, he said during his interaction with Indian students and academicians of Indian origin at the University here.He also emphasised in his frequent foreign trips like this, he is not seeking support from anybody.\"I don't understand why the prime minister doesn't come here and do it, Mr Gandhi asked amidst applause from the audience who had packed the entire auditorium at Stanford.The moderator said that the Prime Minister is welcome to come to Stanford anytime and interact with the students and academicians.Mr Gandhi later tweeted that it was a pleasure to engage with the learned audience at Stanford on 'The New Global Equilibrium'.\"We discussed the challenges and opportunities of a changing world order. Actions based on truth is the way forward,\" he tweeted.Some of the students were denied entry as the auditorium was packed. Students started queuing up two hours before the event started.PromotedListen to thelatest songs, only onJioSaavn.comIn the last one and a half years, several Indian ministers have interacted with Indian students.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF HUMAN RESOURCE DEVELOPMENT"
  },
  {
    "id": "18",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/iit-student-who-died-by-suicide-told-family-about-caste-discrimination-chargesheet-4084112",
    "title": "Friends' Behaviour Changed Over Caste, IIT Student Had Told Sister: Police",

    "text": "IIT Student Suicide:The chargesheet included statements of 55 witnesses.Mumbai:Indian Institute of Technology Bombay (IITB) student Darshan Solanki who allegedly committed suicide had told his mother that caste-based discrimination existed on the institute's campus, a chargesheet filed in the case by police has said.He also told his mother during telephonic conversations that the behaviour of fellow students changed when they learned about his caste, it claimed.The statement of Solnaki's mother is part of the chargesheet filed by the city police on Tuesday before a special court for Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act.The chargesheet named fellow student Arman Khatri who is out on bail after being arrested for allegedly abetting the suicide.Solanki, a first-year student of B-Tech (Chemical) course who hailed from Ahmedabad, allegedly jumped to death from the seventh floor of a hostel building on the IITB campus in Powai area of Mumbai on February 12, 2023, a day after the semester exams ended.The police claimed Khatri had allegedly threatened to kill Solanki after the latter spoke 'offensively' about religion.Solanki's mother in her statement to police said during a telephonic conversation in December 2022, Solanki told his sister that there was caste-based discrimination at the premier institute.When his friends came to know of his caste, there was a change in their behaviour, Solanki's mother said in the statement.Solanki again spoke about this to his sister when he visited them in January 2023 during Makar Sankranti holiday, the chargesheet said.On February 12, he spoke to his mother on phone around 12.20 pm and said he would visit home on February 14 and they should invite all their relatives for a get-together, his mother told the police.Only two hours later, Solanki's father got a call informing his son had suffered a fall, she said in the statement.Solanki's sister and aunt too, in their statements, claimed he faced discrimination and observed change in the behaviour of other students when they learnt of his caste.He spoke about how he was enjoying his studies, but also mentioned that some students and friends always told him that he was getting free education and taunted him, Solanki's aunt told the police.The chargesheet included statements of 55 witnesses, including some students and professors.PromotedListen to thelatest songs, only onJioSaavn.com(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)HelplinesVandrevala Foundation for Mental Health9999666555orhelp@vandrevalafoundation.comTISS iCall022-25521111(Monday-Saturday: 8 am to 10 pm)(If you need support or know someone who does, please reach out to your nearest mental health specialist.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF HUMAN RESOURCE DEVELOPMENT"
  },
  {
    "id": "19",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/300-travellers-stranded-in-uttarakhand-after-massive-lanslide-cuts-off-road-4084155",
    "title": "300 People Stranded In Uttarakhand After Massive Landslide Cuts Off Road",

    "text": "Landslide in Pithoragarh: The road is expected to be opened for traffic after two days.At least 300 travellers are stuck in Pithoragarh district of Uttarakhand after a crucial road got washed away following a landslide.The travellers were left stranded in Dharchula and Gunji after the Lipulekh-Tawaghat road, 45 km above Dharchula, near Lakhanpur, was washed away 100 meters after a large part of the hill fell on the road.\"On the outskirts of Pithoragarh, the Lipulekh-Tawaghat motor road, 45 km above Dharchula, near Lakhanpur, has been washed away 100 meters due to a landslide. About 300 people are trapped in Dharchula and Gunji,\" news agency ANI reported quoting the district administration.According to reports, the road is expected to be opened for traffic after two days.The weather department has issued an alert for dust storm and thundershower Almora, Bageshwar, Chamoli, Champawat, Dehradun, Garhwal, Hardwar, Nainital, Pithoragarh, Rudraprayag, Tehri Garhwal, Udham Singh Nagar and Uttarkashi districts of the state.The police have also issued an advisory and has asked all the pilgrims to stay in safe places.PromotedListen to thelatest songs, only onJioSaavn.com\"Pilgrims please stay at safe places, do not travel unnecessarily, and park vehicles at safe places, landslides/geo. Travel only when the weather is clear,\" they added.\"All the devotees coming for Yamunotri and Gangotri Dham Yatra are requested to plan their journey after taking the weather forecast, keep rain cover, umbrella and woolen/warm clothes with them during the journey,\" they added.",
    "tone": "Neutral",
    "government_body": "MINISTRY OF ROAD TRANSPORT & HIGHWAYS"
  },
  {
    "id": "20",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/panel-led-by-retired-judge-to-probe-manipur-violence-peace-committee-to-be-formed-says-amit-shah-4084313",
    "title": "Panel To Probe Manipur Violence, Amit Shah's Big Warning On Arms: 10 Facts",

    "text": "Amit Shah also warned of stern action against militants who looted weapons from security personnel.New Delhi:Union Home Minister Amit Shah today warned of strict action against those who did not surrender arms in violence-hit Manipur. He also announced a probe into the violence and a peace committee as part of a plan to restore stability in the state.Here are the top 10 updates on this story:Mr Shah also reiterated that the union government had made its stand clear on the territorial integrity of Manipur earlier and did not want to make a statement today on the issue and sensationalise it.A panel led by a retired Chief Justice will probe the ethnic violence in Manipur, Amit Shah said, addressing a press conference after a series of meetings during his four-day visit to the northeastern state. A peace committee would be set up under the Governor and security advisor Kuldeep Singh and members of Civil society.Six cases related to conspiracy in the violence will be probed by the Central Bureau of Investigation or CBI. \"The probe will be conducted by CBI, under the guidance of the Centre. I assure everyone that the probe will be neutral and will go to the roots of the reasons behind the violence,\" Mr Shah said.TheHome Ministeralso warned of stern action against those who looted weapons from security personnel. \"If they don't surrender the weapons, very strong action will be taken,\" he said.The Manipur government and the Central government will together provide Rs 10 lakh compensation to the families of those killed in the violence, Mr Shah said. \"The compensation will be provided through DBT (Direct Benefit Transfer),\" said Mr Shah.The Home Minister, responding to NDTV's question, said he had also held discussions on the perceived public distrust towards the state government.Hours after Amit Shah's press conference, Manipur police chief P Doungel was removed and transferred to Home Department.Rajiv Singh, an Indian Police Service (IPS) officer of the Tripura cadre, has been appointed as the new Director General of Police (DGP) for the northeastern state.The state witnessed a sudden spurt in clashes and firing between insurgents and security forces on Sunday, after a relative lull for over a fortnight. With the state government unable to control the situation even after a month, members from the Kuki-Hmar-Zomi-Mizo tribes on Wednesday held a protest demanding that the Chief Minister be sacked and President's rule implemented in the state.The ethnic violence first broke out after a 'Tribal Solidarity March' was organised in the hill districts on May 3 to protest the Meitei community's demand for Scheduled Tribe (ST) status. The violence was preceded by tension over the eviction of Kuki villagers from reserve forest land, which had led to a series of smaller agitations.Meiteis account for about 53 per cent of Manipur's population and live mostly in the Imphal Valley. Tribals -- Nagas and Kukis -- constitute another 40 percent of the population and reside in the hill districts. So far, over 80 people have been killed in the violence, according to officials.Post a comment",
    "tone": "Neutral",
    "government_body": "MINISTRY OF HOME AFFAIRS"
  },
  {
    "id": "21",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/video-shows-maharashtra-villagers-lifting-newly-made-road-with-bare-hands-4084315",
    "title": "Video Shows Maharashtra Villagers Lifting Newly-Made Road With Bare Hands",

    "text": "A video of the shoddy work in road construction has gone viral.A video gaining traction on social media shows villagers 'lifting' a newly-constructed road with their bare hands. The bizarre incident took place in Maharashtra, as claimed by several Twitter handles. The 38-second clip shows a carpet-like material placed directly under the road, which was constructed by a local contractor. The villagers are heard slamming the shoddy work of the local contractor, who they name as Rana Thakur in the clip. They say the work is \"bogus\" while holding the carpet below the asphalt.Watch the video:When Kaleen Bhaiya ventures into Road construction The contractor made a fake road with carpet as a base!#Maharashtra#India#Wednesdayvibepic.twitter.com/6MpHaL5V6x Rohit Sharma (@DcWalaDesi)May 31, 2023According toFree Press Journal, the incident took place in Karjat-Hast Pokhari, part of Ambad taluka in Maharashtra's Jalna district. The road was constructed under Prime Minister Gram Sadak Yojana (PM Rural Road Scheme).The contractor claimed to employ German technology for the construction of the road, the outlet further claimed.However, as seen in the video, the promise turned out to be hollow as the makeshift solution was exposed by the villagers.The locals also criticised the Maharashtra government. They want action against the engineer who approved the shoddy work, as perFree Press Journal.PromotedListen to thelatest songs, only onJioSaavn.comAccording to Make in India website, India has the second largest road network in the world of about 63.32 lakh kilometres. The Ministry of Road Transport and Highways has various agencies to implement road construction: National Highways Authority of India, the Public Works Departments of states and Union Territories, National Highway and Infrastructure Development Corporation Limited, Border Roads Organization and Indian Academy of Highway Engineers (IAHE).In conventional road construction, a mixture of gravel, sand and compacted soil is used to ensure durability. In recent years, engineers have started using concrete to increase the durability of the road.",
    "tone": "Neutral",
    "government_body": "MINISTRY OF ROAD TRANSPORT & HIGHWAYS"
  },
  {
    "id": "22",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/tcs-warns-employees-not-following-work-from-office-rule-sends-memo-report-4084406",
    "title": "TCS Reacts After Report Claims Staff Warned Over Work-From-Office Rule",

    "text": "The TCS memo warns of disciplinary action against employees who won't comply.Tata Consultancy Services (TCS), India's leading IT services company, has denied reports that it sent strict warning to employees who are not complying with its return to office policy. In a statement, a TCS spokesperson said that the company has been encouraging employees to work from office for three days a week, but has not \"communicated or deployed linkages to career or compensation\". The statement was released afterTimes of Indiacarried a report saying TCS has started sending memos to employees who are not completing at least 12 days of work from office in a month.The memo warned that disciplinary proceedings will be initiated against employees if they do not adhere to the roster, theTOIreportfurther claimed.\"We are excited to see our campuses buzzing with energy and want all our employees to be a part of that vibrant ecosystem. A significant number of employees have joined TCS in the last two years. It is important for them to experience the TCS environment to collaborate, learn, grow and also have fun together, thus developing a stronger sense of belonging to the organisation and enabling better integration,\" the company spokesperson told NDTV.\"Over the last several months we have been encouraging associates in India to return to office and spend 3 days a week at the workplace. This has yielded good results with many of our people returning to office. Our objective is to have all associates work from office for at least 3 days a week on average in the month, and towards the same we continue working with all our groups to have everyone participate. For now, we have not communicated or deployed linkages to career or compensation,\" the spokesperson added.TCS had said last year that it won't allow employees to work 100 per cent remotely - a scenario necessitated by the coronavirus pandemic. It also sent emails to employees asking them to work from office three days a week.As per the TCS model of calling employees to office three days a week, not more than 25 per cent of TCS employees will need to work from the office at a given point.PromotedListen to thelatest songs, only onJioSaavn.comThe company had said last year that rostering will be based on project requirements, and a mix of freshers and experienced professionals will be called to the office.TCS said the process is part of a phased transition from the company's Secure Borderless Workspaces (SBWS) to a more hybrid model which will allow most of its employees to work from the office for some days of the week.",
    "tone": "Positive",
    "government_body": "MINISTRY OF LABOUR & EMPLOYMENT"
  },
  {
    "id": "23",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/pm-narendra-modi-nepalese-counterpart-pushpakamal-dahal-prachanda-hold-bilateral-talks-4084418",
    "title": "PM Modi, Nepalese Counterpart Pushpakamal Dahal Hold Bilateral Talks",

    "text": "PM Modi and Nepal's Pushpakamal Dahal 'Prachanda' today held wide-ranging talks.New Delhi:Prime Minister Narendra Modi and his visiting Nepalese counterpart Pushpakamal Dahal 'Prachanda' today held wide-ranging talks focusing on boosting India-Nepal cooperation in several areas including energy, connectivity and trade.The Nepalese Prime Minister began his four-day visit to India on Wednesday.It is the first bilateral trip abroad by the 68-year-old Communist Party of Nepal-Maoist (CPN-Maoist) leader after he assumed the top office in December 2022.Transforming the civilisational ties between India and Nepal with deeper cooperation in areas of connectivity, economy, energy and infrastructure will be a focus area of talks between PM Modi and Prime Minister Prachanda, people familiar with the Nepalese leader's visit to India said.Nepal is important for India in the context of its overall strategic interests in the region, and the leaders of the two countries have often noted the age-old \"Roti-Beti\" relationship which refers to cross-border marriages between people of the two countries.The country shares a border of over 1,850 km with five Indian states - Sikkim, West Bengal, Bihar, Uttar Pradesh and Uttarakhand.Land-locked Nepal relies heavily on India for the transportation of goods and services.Nepal's access to the sea is through India, and it imports a predominant proportion of its requirements from and through India.The India-Nepal Treaty of Peace and Friendship of 1950 forms the bedrock of the special relations between the two countries.PromotedListen to thelatest songs, only onJioSaavn.comNepalese Foreign Minister NP Saud, who is part of Prime Minister Prachanda's delegation, said on Wednesday that a wide range of issues including trade, transit, connectivity and the border issues will figure in the bilateral talks.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Positive",
    "government_body": "MINISTRY OF EXTERNAL AFFAIRS"
  },
  {
    "id": "24",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/haryana-bjp-leaders-nudge-centre-on-wrestlers-protest-feel-the-pain-4084502",
    "title": "\"Feel The Pain\": On Wrestlers' Protest, Haryana BJP's Dilemma",

    "text": "The wrestlers have been protesting since January.New Delhi:A sense of unease appears to be growing within the ranks of the BJP's unit in Haryana over the central government's handling of the protest by a group of wrestlers, involving grave allegations of sexual harassment against their federation chief, now in its fifth month.The protest is spearheaded by three of the country's top wrestlers - Sakshi Malik, Vinesh Phogat, and Bajrang Punia - all natives of Haryana who have accused the government of not doing enough to address their charges against Brij Bhushan Sharan Singh, a BJP MP and chief of the Wrestling Federation of India.Mr Singh has denied all allegations, and the government, which insists the police investigation is proceeding fairly, has been increasingly stern in its responses to the wrestlers, even flushing out the protest site when the demonstration tried to march to the new parliament building on Sunday.With the Lok Sabha and Haryana Assembly polls on the horizon next year, the campaign has stoked discomfort within the BJP, earning unexpected support from some leaders of the state, including from Hisar MP Brijendra Singh and Haryana Home Minister Anil Vij.\"I feel the pain and helplessness of our wrestlers, forcing them to the brink of throwing away their lifetime of hard work - the medals from Olympics, CWGs, Asian Games in the holy Ganga. Absolutely heartbreaking,\" Mr Singh tweeted this week as the wrestlers trooped to Haridwar.I feel the pain and helplessness of our wrestlers forcing them to the brink of throwing away their lifetime of hardwork- the medals from Olympics, CWGs, Asian Games in the holy Ganga.Absolutely heartbreaking. Brijendra Singh (@BrijendraSpeaks)May 30, 2023Mr Vij had said last month, \"The case of wrestling players who are protesting at Jantar Mantar has been taken over on the higher side. I myself have been the minister of the sports department, and I am completely with the players. If I have to speak or say anything higher in the government, I will do so.\"Despite growing support for the wrestlers, the Haryana BJP leadership has yet to officially take a stance on the issue. Chief Minister Manohar Lal Khattar has refrained from intervening, stating that \"the issue is not related to Haryana\" but the players' teams and the union government.The wrestlers' protest has been bolstered by backing from strong farmers' unions in the state, with talks of a mass protest against Brij Bhushan Sharan Singh. Opposition parties, including the Congress and the INLD, have also thrown their weight behind the wrestlers.Former Union Minister Birender Singh has been vocal about the issue, meeting with the wrestlers and raising the matter with BJP President JP Nadda, stressing that the party's credibility is at stake,The Indian Expressreported.He called for an amicable resolution to the issue at the earliest and emphasized the need for reforms in the way sports federations are run.Haryana BJP president Om Prakash Dhankar also told the newspaper that he raised the issue with Union Sports Minister Anurag Thakur, emphasizing that the protesting wrestlers deserve justice.Mr Thakur, however, has urged the wrestlers to \"trust\" the Delhi Police investigation and \"be patient\" until its conclusion.\"My dear athletes, you should trust the investigation being carried out by the Delhi Police... I urge the wrestlers to be patient until the outcome of the investigation. I also urge them not to take any step that could undermine sports or hurt any sportsperson,\" he said on Wednesday.PromotedListen to thelatest songs, only onJioSaavn.comIn a more combative statement, his colleague Smriti Irani questioned why the wrestlers' protest had not won the support of Babita Phogat, a former wrestler and BJP MP who has distanced herself from the second wave of protests that flared in April and is still working closely with the government.\"I had a chat with Babita Phogat ji. Do you think a world-famous wrestler like Babita Phogat will sit with the people who exploited others and especially her family members? Do you think Babita Phogat will stand against her family members just like that?\" Ms Irani toldTimes Nowchannel.",
    "tone": "Positive",
    "government_body": "MINISTRY OF YOUTH AFFAIRS AND SPORTS"
  },
  {
    "id": "25",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/manipur-police-chief-p-doungel-removed-rajiv-singh-to-replace-him-4084553",
    "title": "Manipur Police Chief Replaced In Centre's Big Move Amid Unrest",

    "text": "Rajiv Singh will be the new DGP of Manipur.New Delhi:In a major reshuffle in the police leadership in Manipur amid simmering violence in the state that has claimed at least 80 lives so far, Rajiv Singh, an Indian Police Service (IPS) officer of the Tripura cadre, has been appointed as the new Director General of Police (DGP) for the northeastern state.Mr Singh, who was previously Inspector General of the Central Reserve Police Force (CRPF), was sent on an inter-cadre deputation to Manipur from the Centre on May 29. The current DGP, P Doungel, has been transferred to the Home Department.The move is seen as an attempt by the Ministry of Home Affairs (MHA) to balance local dynamics by bringing in a non-tribal, non-Meitei police chief, aiming to avoid any potential controversy.Soon after the violence broke out in the state on May 3, the central government appointed former chief of the CRPF Kuldiep Singh as a security adviser to the Manipur government.This change comes on the heels of Union Home Minister Amit Shah's announcement of a judicial probe into the clashes and the establishment of a peace committee to resolve the ongoing crisis. Speaking at a press conference, Mr Shah emphasised dialogue as the key to ending the violence.\"A judicial probe headed by a retired high court chief justice will soon be announced,\" Mr Shah stated, adding that the peace committee would be under the governor of Manipur, Anusuiya Uikey. It will include representatives from all political parties, both Kuki and Meitei communities, and social organizations.The Home Minister also revealed plans for a Central Bureau of Investigation (CBI) probe into five criminal conspiracies and one general conspiracy behind the violence in Manipur. He expressed optimism about the situation normalising soon, characterising the violence as a temporary phase fuelled by misunderstandings.Ethnic violence first broke out in Manipur after a 'Tribal Solidarity March' was organised in the hill districts on May 3 to protest the majority Meitei community's demand for Scheduled Tribe (ST) status - which would divvy up government benefits.PromotedListen to thelatest songs, only onJioSaavn.comThe violence was preceded by tension over the eviction of Kuki villagers from reserve forest land, which had led to a series of smaller agitations.After a relative calm for over a fortnight, the state witnessed a sudden spurt in clashes and firing between insurgents and security forces on Sunday.",
    "tone": "Neutral",
    "government_body": "MINISTRY OF HOME AFFAIRS"
  },
  {
    "id": "26",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/shahbad-dairy-murder-murdered-delhi-teens-boyfriends-custody-extended-by-3-days-4084864",
    "title": "Murdered Delhi Teen's Boyfriend's Custody Extended By 3 Days",

    "text": "Delhi Murder: Earlier on Tuesday, Delhi's Rohini Court had sent Sahil to two-day police custody.New Delhi:Delhi's Rohini Court on Thursday extended police custody of Sahil, the accused in the horrific murder of a minor girl in Shahbad Dairy area of the national capital, for the next three days.He was produced at the residence of the judge after the expiry of two days of police custody on Thursday. He was produced at the judge's residence in the morning due to security reasons.Duty Metropolitan Magistrate (MM) Nidhi Chitkara extended the custody of Sahil for three days after hearing the submissions of Delhi police.On Monday, the parents of the deceased minor girl who was stabbed brutally in Delhi's Shahbad Dairy area demanded the death penalty for the accused Sahil.\"We want the death penalty for him (Sahil). Life for life. The way my daughter is gone, he should also be gone,\" the mother of the deceased told ANI.The father of the 16-year-old girl said, \"The way he brutally killed my daughter he should get the death penalty. I don't want anything from anyone my only demand is that he (Sahil) should be punished,\"\"I work as a labourer, and I have only two children, the first one was her and a small boy, I just want that he should be punished severely,\" he added.Earlier on Tuesday, Delhi's Rohini Court had sent Sahil to two-day police custody.Delhi Police had sought the remand of Sahil on the ground that the weapon used for the murder was not recovered yet and he was changing his versions continuously which needs to be verified.Sources stated that Sahil fled the city after the murder and switched off his phone. He reached Bulandshahr in Uttar Pradesh after changing two buses. Delhi Police arrested him on Monday from Bulandshahr.According to police sources, after committing the murder, Sahil dumped his weapon in Rithala before fleeing to Bulandshahr.A CCTV grab of the incident shows Sahil purportedly stabbing the girl multiple times with a knife. He continued to stab her even when she slumped to the ground. He kicked her and then took a concrete slab lying nearby and bludgeoned her head. All this while the footage showed people watching the events unfold and walking past without intervening. At one point a dog is seen approaching the spot.The police reached the crime spot after the local beat officer was informed by the locals about the incident about 10 minutes after the incident.An initial police investigation concluded that at the time of the incident, the victim did not have a mobile phone.As per the police, the accused was in a relationship with the minor, but they had a quarrel on Sunday night after which he killed her with multiple assaults.The police said that it had registered FIR in the matter under section 302 of the Indian Penal Code (IPC) at Shahbad Dairy Police Station.PromotedListen to thelatest songs, only onJioSaavn.com(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Negative",
    "government_body": "MINISTRY OF HOME AFFAIRS"
  },
  {
    "id": "27",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/aviation-body-asks-airlines-to-frame-guidelines-for-rapid-disembarkation-4084616",
    "title": "Aviation Body Asks Airlines To Frame Guidelines For Rapid Disembarkation",

    "text": "Rapid disembarkation usually happens at the airport. (Representational)New Delhi:Civil aviation regulator Directorate General of Civil Aviation (DGCA) has asked all airline operators to lay down detailed procedures for rapid disembarkation as part of their operations, safety and emergency procedures manual.A circular has been issued to all airlines that specifically mentioned that emergency exits and slides are not to be used in rapid disembarkation unless the crew members decide that this has become necessary.The circular said that rapid disembarkation (also referred to as rapid deplaning, precautionary deplaning, or precautionary disembarkation) is a precautionary egress from the aircraft in situations assessed by the crew members as deviating from normal conditions but not being an immediate emergency -- not posing an immediate threat to passengers and crew members on board, but which may escalate into an emergency.Rapid disembarkation usually happens at the airport.It further said that in the event of an emergency in an aeroplane, when on the ground, the Pilot In Command (PIC) is responsible for the safety of occupants on board.During disembarkation, therefore passengers and crew members will leave all their belongings on board unless they are instructed otherwise. Crew members' instruction (words used) for rapid disembarkation will be different from that used for evacuation.PromotedListen to thelatest songs, only onJioSaavn.comThe regulator said it is essential that the operator lays down communication procedures for the smooth conduct of rapid disembarkation.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF CIVIL AVIATION"
  },
  {
    "id": "28",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/world-milk-day-2023-all-you-need-to-know-about-the-day-4084625",
    "title": "World Milk Day 2023: All You Need To Know About The Day",

    "text": "World Milk Day is celebrated annually on June 1.World Milk Day, established by the Food and Agriculture Organization (FAO) of the United Nations, has been observed across the world since its inception in 2001. The idea behind the special day is to bring the importance of milk as a global food to the forefront and to promote dairy farming and the dairy industry. Over time, the FAO has carried out various campaigns to raise awareness about the nutritional value and significance of milk in a balanced diet.As perworldmilkday.org, this year, the theme of World Milk Day is showcasing how dairy is reducing its environmental footprint, while also providing nutritious foods and livelihoods. As an agency dedicated to eradicating hunger and promoting sustainable agriculture, the FAO used the day to educate individuals, communities, organisations, and governments to understand the potential of milk in combating malnutrition across the world and scale up the efforts in this regard.PromotedListen to thelatest songs, only onJioSaavn.comOn this occasion, stakeholders across the world, from farmers to policymakers, celebrate the benefits of milk, while also designing initiatives to improve dairy production in a sustainable manner and address challenges faced by the industry. Consumers are also actively roped into such processes to promote responsible consumption patterns. The focus is on encouraging manufacturing methods that reduce water consumption and greenhouse gas emission, as well as promote animal welfare and safe working conditions.Additionally, focus is also placed on the larger economic impact of the dairy industry in the global economy. From providing jobs to millions of people to giving rise to several sub-industries, the impact of the dairy industry is not just appreciated but also studied on the occasion of World Milk Day.",
    "tone": "Neutral",
    "government_body": "MINISTRY OF FISHERIES, ANIMAL HUSBANDRY & DAIRYING"
  },
  {
    "id": "29",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/indian-air-forces-kiran-trainer-aircraft-crashes-near-karnatakas-chamrajnagar-crew-ejected-safely-4084672",
    "title": "Air Force's Trainer Aircraft Crashes In Karnataka, Crew Eject Safely",

    "text": "IAF Kiran Trainer Aircraft: Senior district officials and an IAF team reached the spot.Bengaluru:A trainer aircraft of the Indian Air Force crashed during a routine sortie in Karnataka today, the Air Force said in a statement. Both pilots on board the aircraft ejected safely before the crash, it said.The aircraft was on a routine sortie and crashed in an open field in a village near Chamrajnagar district, about 136 km from Bengaluru, according to the Air Force.Both the pilots sustained minor injuries, news agency PTI reported quoting district officials. No casualties were reported.PromotedListen to thelatest songs, only onJioSaavn.comA board of inquiry (BoI) has been ordered to investigate the cause of the crash.\"Kiran trainer aircraft of the IAF crashed near Chamrajnagar, Karnataka today, while on a routine training sortie. Both aircrew ejected safely. A Court of Inquiry has been ordered to ascertain the cause of the accident,\" the Air Force said in a statement.A Kiran trainer aircraft of the IAF crashed near Chamrajnagar, Karnataka today, while on a routine training sortie. Both aircrew ejected safely. A Court of Inquiry has been ordered to ascertain the cause of the accident.- Indian Air Force (@IAF_MCC)June 1, 2023Senior district officials and an IAF team reached the spot.",
    "tone": "Positive",
    "government_body": "MINISTRY OF DEFENCE"
  },
  {
    "id": "30",
    "source": "Ndtv",
    "publication_date": "2023-06",
    "link": "https://www.ndtv.com/india-news/russias-rupee-trap-is-adding-to-147-billion-hoard-stuck-abroad-4084706",
    "title": "Russia's Rupee Trap Is Adding To $147 Billion Hoard Stuck Abroad",

    "text": "For Russia, the only acceptable option is to use currencies of a third country.A lopsided trade relationship with India is forcing Russia to accumulate up to $1 billion each month in rupee assets that remain stranded outside the country, swelling the stockpile of capital it's amassed abroad since the invasion of Ukraine.Russia has emerged as a top supplier of oil to India over the past year, settling a greater share of trade in national currencies and redirecting shipments east as traditional customers in Europe shunned purchases after the war began over a year ago.But with imports from India stagnating, Russia is ending up with an excess of rupees, which its companies have trouble repatriating because of local currency restrictions. Deadlock over a solution has left Russia expecting the surplus to rise further, according to people familiar with the negotiations.Every quarter, the imbalance will likely generate the equivalent of $2 billion to $3 billion that Russia can't use, according to Bloomberg Economics. The amount would add to an estimated $147 billion in net foreign assets built up abroad over the course of 2022.\"The reason is a sharp boost in the volume of oil supplies from Russia,\" said Irina Zasedatel, a member of the presidium of Russia's Association of Exporters and Importers. \"Against the backdrop of an increase in the growth of oil sales, there's little sign of expansion in the supply of other goods.\"An impasse at the negotiating table between India and Russia is complicating their booming one-way trade. In the first quarter, India had a trade deficit $14.7 billion with Russia.A top priority for India is to promote the wider use of the rupee in international settlements. The central bank has suggested that countries accumulating excess rupees from exports can put the funds in local securities including government bonds.The two countries are discussing various payment mechanisms including investments in India's capital markets by Russian entities.It's an option that initially didn't find favor with Moscow but is now back on the table as billions of rupees pile up in Indian banks, officials in India familiar with the details said, asking not to be named because discussions were private. Other possibilities include channeling the accumulated rupees into Indian infrastructure projects in exchange for equity stakes.For Russia, the only acceptable option is to use currencies of a third country, such as China's yuan or the United Arab Emirates dirham, said people familiar with the deliberations. An agreement is far off since Russia has limited sway in a situation with few alternative buyers to India, they said, asking for anonymity to describe the private talks.Russia's government and its central bank didn't respond to requests for comment, and neither did India's Ministry of External Affairs.What Bloomberg Economics Says...\"Russia's trade with India is increasingly imbalanced. India's exports to Russia haven't caught up with booming imports, but there's a limited appetite in Russia to save its current-account surplus in rupees. That said, there are no alternative oil importers of India's caliber on the horizon for Russia, so exporters and banks will gradually accept settlement in rupees. This will allow Russia to keep its oil flowing, but will make hard currency more scarce, weaken the ruble and push inflation higher.\" Alexander Isakov, Russia economist.Though changes in how the government in Moscow taxes oil companies have succeeded in stabilizing public finances after a record surge in spending, the inability to retrieve earnings deprives Russia of hard currency at a time when its exporters already face longer wait times for payments because many domestic banks have lost access to their correspondent accounts in the west.PromotedListen to thelatest songs, only onJioSaavn.comIn the months following the invasion, households and companies have also been moving billions of dollars in funds to banks abroad. And with some foreign revenue now trapped overseas, pressure on the ruble may grow worse since fewer export proceeds will be converted into the Russian currency.The warping of commerce leaves few good options for the Kremlin and underscores how little bargaining power it has in a redrawn global oil market that's seen Asian powerhouses India and China scoop up cheaper Russian oil. It also shows why a shift away from the currencies of Russia's adversaries remains fraught with risks.(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
    "tone": "Neutral",
    "government_body": "MINISTRY OF COMMERCE & INDUSTRY"
  }
]
